//1: Выполнение предварительных условий
//2: Разработка алгоритма

//Алгоритм сложения трех чисел и вывода их суммы:
//1. Получить от пользователя три целочисленные переменные num1, num2 и num3.
//2. Объявить целочисленную переменную sum.
//3. Присвоить переменной sum значение выражения num1 + num2 + num3.
//4. Вывести значение переменной sum.

//Шаг 3: Проверка алгоритма путем его реализации.

// Шаг 2: Разработка алгоритма



// 1. Получить от пользователя три целочисленные переменные num1, num2 и num3.
let num1 = parseInt(prompt('Введите первое число:'));
let num2 = parseInt(prompt('Введите второе число:'));
let num3 = parseInt(prompt('Введите третье число:'));

// 2. Объявить целочисленную переменную sum.
let sum;

// 3. Присвоить переменной sum значение выражения num1 + num2 + num3.
sum = num1 + num2 + num3;

// 4. Вывести значение переменной sum.
console.log('Сумма трех чисел:', sum);


